tutorials/07_motorBike/system/blockMeshDict
FoamFile
{
    version     2.0;
    format     ascii;
    class     dictionary;
    object     blockMeshDict;
}

scale 1.0;

vertices
(
    (0 0 0)
    (20 0 0)
    (20 8 0)
    (0 8 0)
    (0 0 8)
    (20 0 8)
    (20 8 8)
    (0 8 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 8 8) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
    front
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (3 2 6 7)
        );
    }
)

mergePatchPairs
(
);
