tutorials/07_motorBike/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

surfaces
(
    "motorBike.obj"
);

includedAngle   60;
